---
kind: property
id: P:Autodesk.Revit.DB.ReferencePointArray.IsEmpty
source: html/9b66a518-fd04-b237-2912-1b2da29a5d03.htm
---
# Autodesk.Revit.DB.ReferencePointArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.